In [2]:
import pandas as pd

In [3]:
data = {
    'Name': ['ab', 'bc', 'cd'],
    'Age': [25, 30, 33]
}

In [5]:
df = pd.DataFrame(data)

In [11]:
above_30 = df['Age'] >= 30

In [12]:
df[above_30]

  Name  Age
1   bc   30
2   cd   33

In [13]:
pd.Series([25, 28, 22], name='Age')

0    25
1    28
2    22
Name: Age, dtype: int64

In [14]:
data = {'Name': ['John', 'Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22, 35],
        'Salary': [50000, 60000, 55000, 70000]}

In [18]:
df = pd.DataFrame(data)

In [17]:
df['Age'] < 30

0     True
1    False
2    False
Name: Age, dtype: bool

In [19]:
df[(df['Age'] < 30) & (df['Salary'] > 55000)]

Empty DataFrame
Columns: [Name, Age, Salary]
Index: []

In [20]:
df[df['Name'].isin(['Alice', 'Charlie'])]

      Name  Age  Salary
1    Alice   30   60000
3  Charlie   35   70000

In [21]:
df[df['Name'].str.startswith('A')]

    Name  Age  Salary
1  Alice   30   60000

In [25]:
data = {'Category': ['A', 'B', 'A', 'B', 'A', 'B'],
        'Value': [10, 15, 20, 25, 30, 35]}

In [27]:
df = pd.DataFrame(data)
 
# Grouping by 'Category'
grouped = df.groupby('Category')

In [28]:
df

  Category  Value
0        A     10
1        B     15
2        A     20
3        B     25
4        A     30
5        B     35

In [31]:
grouped['Value'].sum()

Category
A    60
B    75
Name: Value, dtype: int64

In [32]:
grouped['Value'].mean()

Category
A    20.0
B    25.0
Name: Value, dtype: float64

In [33]:
grouped['Value'].max()

Category
A    30
B    35
Name: Value, dtype: int64

In [34]:
grouped['Value'].min()

Category
A    10
B    15
Name: Value, dtype: int64

In [35]:
grouped['Value'].count()

Category
A    3
B    3
Name: Value, dtype: int64